Revit 2027 API
ViewSchedule.GetDefaultParameterNameForKeySchedule Method
 Gets the default parameter name that will be used when creating a key schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetDefaultParameterNameForKeySchedule(
	Document document,
	ElementId categoryId
)
Public Shared Function GetDefaultParameterNameForKeySchedule (
	document As Document,
	categoryId As ElementId
) As String
public:
static String^ GetDefaultParameterNameForKeySchedule(
	Document^ document,
	ElementId^ categoryId
)
static member GetDefaultParameterNameForKeySchedule :
        document : Document *
        categoryId : ElementId -> string
Parameters
document Document
 The document to which the new schedule will be added.
categoryId ElementId
 The ID of the category of elements that the schedule's keys will be associated with.
Return Value
String
 The default parameter name.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- categoryId is not a valid category for a key schedule.
ArgumentNullException |  A non-optional argument was null
Remarks
 See ViewSchedule.KeyScheduleParameterName for details.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace